### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
azurerm_app_service_plan.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan]
azurerm_app_service.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]
azurerm_app_service.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service.api has changed
  ~ resource "azurerm_app_service" "api" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api"
        name                              = "os-onlinestore-prod-api"
      + tags                              = {}
        # (17 unchanged attributes hidden)


      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }


      ~ site_config {
          + default_documents                    = []
            # (18 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_app_service.website has changed
  ~ resource "azurerm_app_service" "website" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website"
        name                              = "os-onlinestore-prod-website"
      + tags                              = {}
        # (17 unchanged attributes hidden)


      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }



        # (4 unchanged blocks hidden)
    }

  # azurerm_app_service_plan.default has changed
  ~ resource "azurerm_app_service_plan" "default" {
        id                           = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan"
        name                         = "onlinestore-plan"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.default has changed
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg"
        name     = "onlinestore-prod-rg"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.api must be replaced
-/+ resource "azurerm_app_service" "api" {
      ~ app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      ~ app_settings                      = {
          - "WEBSITE_NODE_DEFAULT_VERSION" = "6.9.1"
        } -> (known after apply)
      ~ client_cert_mode                  = "Required" -> (known after apply)
      ~ custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> (known after apply)
      ~ default_site_hostname             = "os-onlinestore-prod-api.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ location                          = "northeurope" -> "eastus" # forces replacement
        name                              = "os-onlinestore-prod-api"
      ~ outbound_ip_address_list          = [
          - "20.82.254.214",
          - "20.82.254.221",
          - "20.82.254.235",
          - "20.82.254.240",
          - "20.82.254.248",
          - "20.82.253.47",
          - "20.50.64.27",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.82.254.214,20.82.254.221,20.82.254.235,20.82.254.240,20.82.254.248,20.82.253.47,20.50.64.27" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.82.254.214",
          - "20.82.254.221",
          - "20.82.254.235",
          - "20.82.254.240",
          - "20.82.254.248",
          - "20.82.253.47",
          - "20.82.255.14",
          - "20.82.255.18",
          - "20.82.255.22",
          - "20.82.255.26",
          - "20.82.254.161",
          - "20.82.255.47",
          - "20.82.255.51",
          - "20.82.255.56",
          - "20.82.255.101",
          - "20.82.255.129",
          - "20.82.255.139",
          - "20.82.255.167",
          - "20.82.255.171",
          - "20.82.254.30",
          - "20.82.255.159",
          - "20.82.255.191",
          - "20.82.254.162",
          - "20.82.254.156",
          - "20.82.254.69",
          - "20.82.255.211",
          - "20.82.255.231",
          - "20.82.255.238",
          - "20.82.255.249",
          - "20.82.255.255",
          - "20.50.64.27",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.82.254.214,20.82.254.221,20.82.254.235,20.82.254.240,20.82.254.248,20.82.253.47,20.82.255.14,20.82.255.18,20.82.255.22,20.82.255.26,20.82.254.161,20.82.255.47,20.82.255.51,20.82.255.56,20.82.255.101,20.82.255.129,20.82.255.139,20.82.255.167,20.82.255.171,20.82.254.30,20.82.255.159,20.82.255.191,20.82.254.162,20.82.254.156,20.82.254.69,20.82.255.211,20.82.255.231,20.82.255.238,20.82.255.249,20.82.255.255,20.50.64.27" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "Snk34rdMnMFFssu9Cnhn8Fosuxfj2M5kFKtc7cS8SR6Fb4H8P5BoFPsquiQp"
              - username = "$os-onlinestore-prod-api"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (5 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "9c9c2226-a067-4941-b98c-1bae8bff7183" -> (known after apply)
          ~ tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          ~ default_documents                    = [
              + "index.html",
            ]
          ~ ftps_state                           = "AllAllowed" -> (known after apply)
          ~ ip_restriction                       = [] -> (known after apply)
          + linux_fx_version                     = (known after apply)
          ~ local_mysql_enabled                  = false -> (known after apply)
          ~ managed_pipeline_mode                = "Integrated" -> (known after apply)
          ~ min_tls_version                      = "1.2" -> (known after apply)
          ~ number_of_workers                    = 1 -> (known after apply)
          ~ remote_debugging_version             = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                   = [] -> (known after apply)
          ~ scm_type                             = "None" -> (known after apply)
          ~ vnet_route_all_enabled               = false -> (known after apply)
          ~ websockets_enabled                   = false -> (known after apply)
          + windows_fx_version                   = (known after apply)
            # (7 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service.website must be replaced
-/+ resource "azurerm_app_service" "website" {
      ~ app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      ~ app_settings                      = {
          - "WEBSITE_NODE_DEFAULT_VERSION" = "6.9.1"
        } -> (known after apply)
      ~ client_cert_mode                  = "Required" -> (known after apply)
      ~ custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> (known after apply)
      ~ default_site_hostname             = "os-onlinestore-prod-website.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ location                          = "northeurope" -> "eastus" # forces replacement
        name                              = "os-onlinestore-prod-website"
      ~ outbound_ip_address_list          = [
          - "20.82.254.214",
          - "20.82.254.221",
          - "20.82.254.235",
          - "20.82.254.240",
          - "20.82.254.248",
          - "20.82.253.47",
          - "20.50.64.27",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.82.254.214,20.82.254.221,20.82.254.235,20.82.254.240,20.82.254.248,20.82.253.47,20.50.64.27" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.82.254.214",
          - "20.82.254.221",
          - "20.82.254.235",
          - "20.82.254.240",
          - "20.82.254.248",
          - "20.82.253.47",
          - "20.82.255.14",
          - "20.82.255.18",
          - "20.82.255.22",
          - "20.82.255.26",
          - "20.82.254.161",
          - "20.82.255.47",
          - "20.82.255.51",
          - "20.82.255.56",
          - "20.82.255.101",
          - "20.82.255.129",
          - "20.82.255.139",
          - "20.82.255.167",
          - "20.82.255.171",
          - "20.82.254.30",
          - "20.82.255.159",
          - "20.82.255.191",
          - "20.82.254.162",
          - "20.82.254.156",
          - "20.82.254.69",
          - "20.82.255.211",
          - "20.82.255.231",
          - "20.82.255.238",
          - "20.82.255.249",
          - "20.82.255.255",
          - "20.50.64.27",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.82.254.214,20.82.254.221,20.82.254.235,20.82.254.240,20.82.254.248,20.82.253.47,20.82.255.14,20.82.255.18,20.82.255.22,20.82.255.26,20.82.254.161,20.82.255.47,20.82.255.51,20.82.255.56,20.82.255.101,20.82.255.129,20.82.255.139,20.82.255.167,20.82.255.171,20.82.254.30,20.82.255.159,20.82.255.191,20.82.254.162,20.82.254.156,20.82.254.69,20.82.255.211,20.82.255.231,20.82.255.238,20.82.255.249,20.82.255.255,20.50.64.27" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "WkyvCp07evTdkYlTGpE8MenAmH0YJPpEKHBzT7gJATNytHEaqd4cDC8huKmc"
              - username = "$os-onlinestore-prod-website"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (5 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "1845504b-ee60-4e5c-81d2-8569aa1aa18d" -> (known after apply)
          ~ tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          ~ ftps_state                           = "AllAllowed" -> (known after apply)
          ~ ip_restriction                       = [] -> (known after apply)
          + linux_fx_version                     = (known after apply)
          ~ local_mysql_enabled                  = false -> (known after apply)
          ~ managed_pipeline_mode                = "Integrated" -> (known after apply)
          ~ min_tls_version                      = "1.2" -> (known after apply)
          ~ number_of_workers                    = 1 -> (known after apply)
          ~ remote_debugging_version             = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                   = [] -> (known after apply)
          ~ scm_type                             = "None" -> (known after apply)
          ~ vnet_route_all_enabled               = false -> (known after apply)
          ~ websockets_enabled                   = false -> (known after apply)
          + windows_fx_version                   = (known after apply)
            # (8 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.default must be replaced
-/+ resource "azurerm_app_service_plan" "default" {
      ~ id                           = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> (known after apply)
      - is_xenon                     = false -> null
      ~ location                     = "northeurope" -> "eastus" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 1 -> (known after apply)
        name                         = "onlinestore-plan"
      - per_site_scaling             = false -> null
      - tags                         = {} -> null
      - zone_redundant               = false -> null
        # (3 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 0 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.default must be replaced
-/+ resource "azurerm_resource_group" "default" {
      ~ id       = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg" -> (known after apply)
      ~ location = "northeurope" -> "eastus" # forces replacement
        name     = "onlinestore-prod-rg"
      - tags     = {} -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Plan - prod`*